import pygame
pygame.init()
pygame.mixer.init()
from collections import OrderedDict

# Маппинг имен букв на их коды
letter_code_map = {
    'а': 1,
    'б': 11,
    'в': 111010,
    'г': 11011,
    'д': 11001,
    'е': 10001,
    'ё': 100001,
    'ж': 11010,
    'з': 110101,
    'и': 1010,
    'й': 101111,
    'к': 101,
    'л': 111,
    'м': 1101,
    'н': 11101,
    'о': 10101,
    'п': 1111,
    'р': 10111,
    'с': 1110,
    'т': 11110,
    'у': 100101,
    'ф': 1011,
    'х': 10011,
    'ц': 1001,
    'ч': 11111,
    'ш': 110001,
    'щ': 101101,
    'ъ': 110111,
    'ы': 101110,
    'ь': 111110,
    'э': 101010,
    'ю': 110011,
    'я': 101011,
    'пробел': 0
}

# Словарь с диктантом
dictations = OrderedDict([
    ("Начальный диктант", ["а", "ка", "ак", "баба", "алла", "мама", "амам", "мак", "мала", "папа"]),
    ("У", ["лук", "лапа", "лупа", "колобок"]),
    ("Р", ["рука", "рама", "лора"]),
    ("О", ["рома", "лоб", "бор"]),
    ("С", ["сок", "суп", "собака", "сам", "сом", "сама", "сор"]),
    ("Т", ["стол", "стул", "кот", "рот", "Тома", "тут", "там"]),
    ("И", ["ира", "кира", "рис", "риск", "тиски"]),
    ("Д", ["дом", "да", "Дима", "лодка", "дуб", "иди", "домик"]),
    ("Н", ["нос", "нина", "на", "нитка", "ната", "сон"]),
    ("Й", ["дай", "майка", "мой руки", "лейка", "линейка", "сарай"]),
    ("З", ["зуб", "зима", "зонт", "Зина", "роза", "арбуз", "зеркало", "зоя"]),
    ("В", ["вова", "вот", "ваза", "вата", "ванна", "двор", "волос"]),
    ("Г", ["голова", "голос", "горло", "глаза", "магазин", "гора"]),
    ("Е", ["гена", "лена", "лес", "веник", "мел", "сено"]),
    ("Ё", ["ёлка", "мёд", "берёза"]),
    ("Ж", ["ёж", "жук", "нож", "ложка", "ножка", "лужа"]),
    ("Ч", ["чайник", "качели", "дочка", "чай"]),
    ("Щ", ["щи", "щука", "щека", "щётка", "борщ"]),
    ("Ш", ["шапка", "шуба", "маша", "саша", "каша", "уши"]),
    ("Ц", ["курица", "улица", "солнце"]),
    ("Я", ["яблоко", "яша", "яйцо", "яма", "таня", "валя", "ягода"]),
    ("Х", ["хлеб", "хорошо", "халат", "ухо", "орех", "плохо", "хор", "ход"]),
    ("Ю", ["юла", "юля", "юбка", "утюг", "ключ", "юра"]),
    ("Ы", ["сыр", "сын", "зубы", "мыло", "часы", "дырка"]),
    ("Ф", ["фото", "фартук", "футбол", "кофта", "конфета", "фары"]),
    ("Э", ["этаж", "это", "эликсир"]),
    ("Ь", ["дочь", "ночь", "день", "мышь", "гусь", "лось", "деньги"]),
    ("Ъ", ["подъезд", "разъезд", "отъезд", "въезд", "съезд"])
])

# Буквы для диктанта
letters_for_dictations = ["Начальный диктант", "У", "Р", "О", "С", "Т", "И", "Д", "Н", "Й", "З", "В", "Г", "Е", "Ё", "Ж", "Ч", "Щ", "Ш", "Ц", "Я", "Х", "Ю", "Ы", "Ф", "Э", "Ь", "Ъ"]

sounds = [
            pygame.mixer.Sound('sounds\диктант завершён.ogg'),
            pygame.mixer.Sound('sounds\наберите букву.ogg'),
            
            pygame.mixer.Sound('sounds\наберите слово.ogg'),
            pygame.mixer.Sound('sounds\набрать букву заново.ogg'),
            
            pygame.mixer.Sound('sounds\неправильно.ogg'),
            pygame.mixer.Sound('sounds\правильно.ogg'),
            
            pygame.mixer.Sound('sounds\сейчас будет диктант на букву.ogg'),
            pygame.mixer.Sound('sounds\чтобы остановить программу наберите слово стоп.ogg'),
            
            pygame.mixer.Sound('sounds\сейчас будет начальный диктант.ogg'),
            pygame.mixer.Sound('sounds\введите свой код ученика.ogg'),
         ]

letter_map = {
            1: 'А', 11: 'Б', 111010: 'В', 11011: 'Г', 11001: 'Д',
            10001: 'Е', 100001: 'Ё', 11010: 'Ж', 110101: 'З', 1010: 'И',
            101111: 'Й', 101: 'К', 111: 'Л', 1101: 'М', 11101: 'Н',
            10101: 'О', 1111: 'П', 10111: 'Р', 1110: 'С', 11110: 'Т',
            100101: 'У', 1011: 'Ф', 10011: 'Х', 1001: 'Ц', 11111: 'Ч',
            110001: 'Ш', 101101: 'Щ', 110111: 'Ъ', 101110: 'Ы', 111110: 'Ь',
            101010: 'Э', 110011: 'Ю', 101011: 'Я', 0: ' '
        }

def play_sound(self):
        self.play()